---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures.MainEngagementParameterWarning
source: html/ad7d5a9b-c776-bfa7-ea1c-4b1a91c3f7c5.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures.MainEngagementParameterWarning Property

This is used to post warning. "Bar Engagement 1" has an incorrect value.

## Syntax (C#)
```csharp
public static FailureDefinitionId MainEngagementParameterWarning { get; }
```